(function () {
    const burgerItem = document.querySelector(".burger-menu");
    burgerItem.addEventListener("click", () => {
        console.log(burgerItem)
    })
}());











console.log("Total score: 110 \n" +
        "Вёрстка валидная +10 \n" +
        "<header>, <main>, <footer> +3 \n" +
        "<header>, <main>, <footer> +3 \n" +
        "4 <section> (по количеству секций) +3\n" +
        "только 1 заголовок <h1> +3 \n" +
        "3 заголовка <h2> +3 \n" +
        "1 элемент <nav> (панель навигации) +3 \n" +
        "2 списка ul > li > a (панель навигации, ссылки на соцсети) +3 \n" +
        "4 кнопки <button> +2\n" +
        "Вёрстка соответствует макету +48 \n" +
        "для построения сетки используются флексы  +2 \n" +
        "при уменьшении масштаба страницы браузера вёрстка размещается по центру +2 \n" +
        "фоновый цвет тянется на всю ширину страницы +2 \n" +
        "иконки добавлены в формате .svg. +2 \n" +
        "изображения добавлены в формате .jpg +2 \n" +
        "есть favicon +2\n" +
        "плавная прокрутка по якорям +5 \n" +
        "иконки соцсетей в футере при нажатии на них ведут на гитхаб автора проекта и на страницу курса +5 \n" +
        "интерактивность включает в себя другие визуальные эффекты - изменение цвета шрифта +5 \n" +
        "плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы +5\n");